Revit 2020 API
UnitUtils.GetUnitGroup Method
 Gets the unit group for a given unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static UnitGroup GetUnitGroup(
	UnitType unitType
)
Visual Basic
Public Shared Function GetUnitGroup ( _
	unitType As UnitType _
) As UnitGroup
Visual C++
public:
static UnitGroup GetUnitGroup(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type.
Return Value
 The unit group.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace